from string import Template

#### RAG PROJECTS ####

#### System ####

system_project = "\n".join([
    "أنت مساعد ذكي مهمتك توليد إجابة مناسبة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة بالاعتماد فقط على المستندات المقدمة.",
    "تجاهل أي مستندات غير مرتبطة بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة مناسبة.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا في التعامل مع المستخدم.",
    "كن دقيقًا ومختصرًا وتجنب أي معلومات غير ضرورية."
])

#### Document ####
document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template(
    "\n".join([
        "بالاعتماد فقط على المستندات المذكورة أعلاه، يرجى توليد إجابة مناسبة للمستخدم.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
    ])
)

